scenarios/user_buying_some_stuff-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: user buying some stuff-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: user buying some stuff-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  user buying some stuff-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1398,736)
      - go(http://127.0.0.1:52879/)
      - clickByCSS(div.hot-product-card-img-overlay)
      - clickByID(quantity)
      - selectByID(quantity): "4"
      - clickByXPath(//*[text() = "Add To Cart"])
      - clickByCSS(img.top-left-logo)
      - clickByXPath(//div[4]/a/div)
      - clickByID(quantity)
      - selectByID(quantity): "4"
      - clickByXPath(//*[text() = "Add To Cart"])
      - clickByCSS(img.top-left-logo)
      - clickByXPath(//div[9]/a/div)
      - clickByID(quantity)
      - selectByID(quantity): "3"
      - clickByXPath(//*[text() = "Add To Cart"])

  user buying some stuff-Http:
    headers:
      sec-ch-ua: '"Chromium";v="130", "Google Chrome";v="130", "Not?A_Brand";v="99"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"macOS"'
      DNT: '1'
      Upgrade-Insecure-Requests: '1'
      User-Agent: >-
        Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36
        (KHTML, like Gecko) Chrome/130.0.0.0 Safari/537.36
      Accept: >-
        text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://127.0.0.1:52879/product/OLJCESPC7Z'
            method: GET
            label: 'http://127.0.0.1:52879/product/OLJCESPC7Z'
            think-time: 0ms
            headers: {}
          - url: 'http://127.0.0.1:52879/product/1YMWWN1N4O'
            method: GET
            label: 'http://127.0.0.1:52879/product/1YMWWN1N4O'
            think-time: 4369ms
            headers: {}
          - url: 'http://127.0.0.1:52879/'
            method: GET
            label: 'http://127.0.0.1:52879/'
            think-time: 4038ms
            headers: {}
          - url: 'http://127.0.0.1:52879/product/9SIQT8TOJO'
            method: GET
            label: 'http://127.0.0.1:52879/product/9SIQT8TOJO'
            think-time: 1365ms
            headers: {}
          - url: 'http://127.0.0.1:52879/cart'
            method: POST
            label: 'http://127.0.0.1:52879/cart'
            think-time: 3284ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              product_id: 9SIQT8TOJO
              quantity: '3'