scenarios/user_only_looing_for_goods-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: user only looing for goods-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: user only looing for goods-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  user only looing for goods-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1398,736)
      - go(http://127.0.0.1:52879/)
      - clickByCSS(div.hot-product-card-img-overlay)
      - clickByCSS(img.top-left-logo)
      - clickByXPath(//div[7]/a/div)
      - clickByID(quantity)
      - selectByID(quantity): "4"
      - clickByCSS(img.top-left-logo)
      - clickByXPath(//div[9]/a/div)
      - clickByCSS(img.top-left-logo)
      - clickByXPath(//div[5]/a/div)
      - clickByCSS(img.top-left-logo)
      - clickByXPath(//div[7]/a/div)
      - clickByCSS(img.top-left-logo)

  user only looing for goods-Http:
    headers:
      sec-ch-ua: '"Chromium";v="130", "Google Chrome";v="130", "Not?A_Brand";v="99"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"macOS"'
      DNT: '1'
      Upgrade-Insecure-Requests: '1'
      User-Agent: >-
        Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36
        (KHTML, like Gecko) Chrome/130.0.0.0 Safari/537.36
      Accept: >-
        text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://127.0.0.1:52879/product/OLJCESPC7Z'
            method: GET
            label: 'http://127.0.0.1:52879/product/OLJCESPC7Z'
            think-time: 0ms
            headers: {}
          - url: 'http://127.0.0.1:52879/product/9SIQT8TOJO'
            method: GET
            label: 'http://127.0.0.1:52879/product/9SIQT8TOJO'
            think-time: 7928ms
            headers: {}
          - url: 'http://127.0.0.1:52879/product/L9ECAV7KIM'
            method: GET
            label: 'http://127.0.0.1:52879/product/L9ECAV7KIM'
            think-time: 2789ms
            headers: {}
          - url: 'http://127.0.0.1:52879/product/0PUK6V6EV0'
            method: GET
            label: 'http://127.0.0.1:52879/product/0PUK6V6EV0'
            think-time: 3511ms
            headers: {}
          - url: 'http://127.0.0.1:52879/'
            method: GET
            label: 'http://127.0.0.1:52879/'
            think-time: 1339ms
            headers: {}