scenarios/user_place_orders-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: user place orders-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: user place orders-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  user place orders-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1398,736)
      - go(http://127.0.0.1:52879/)
      - clickByCSS(div.hot-product-card-img-overlay)
      - clickByID(quantity)
      - selectByID(quantity): "3"
      - clickByCSS(img.top-left-logo)
      - clickByXPath(//div[7]/a/div)
      - clickByID(quantity)
      - selectByID(quantity): "2"
      - clickByXPath(//*[text() = "Add To Cart"])
      - clickByCSS(img.top-left-logo)
      - clickByXPath(//div[9]/a/div)
      - clickByID(quantity)
      - selectByID(quantity): "3"
      - clickByXPath(//*[text() = "Add To Cart"])
      - clickByCSS(img.top-left-logo)
      - clickByXPath(//div[10]/a/div)
      - clickByID(quantity)
      - selectByID(quantity): "3"
      - clickByXPath(//*[text() = "Add To Cart"])
      - clickByXPath(//div[3]/div[2]/div[3]/div)
      - clickByXPath(//div[3]/div[2]/div[2]/div)
      - clickByXPath(//*[text() = "Bamboo Glass Jar"])
      - clickByCSS(img.img-fluid)
      - clickByXPath(//*[text() = "Add To Cart"])
      - clickByXPath(//*[text() = "Credit Card Number"])
      - clickByXPath(//*[text() = "City"])
      - clickByID(email)
      - typeByID(email): "someone@efxample.com"
      - clickByID(email)
      - clickByID(email)
      - doubleClickByID(email)
      - clickByID(email)
      - typeByID(email): "someOne"
      - keysByID(email): KEY_DOWN
      - typeByID(email): "someOne@example.de"
      - clickByID(street_address)
      - clickByID(street_address)
      - clickByID(street_address)
      - doubleClickByID(street_address)
      - clickByID(street_address)
      - typeByID(street_address): "elmstreet"
      - clickByID(zip_code)
      - clickByID(city)
      - clickByID(city)
      - doubleClickByID(city)
      - clickByID(city)
      - clickByID(state)
      - clickByID(country)
      - clickByID(country)
      - doubleClickByID(country)
      - clickByXPath(//*[contains(text(), "Cart (9)")])
      - clickByID(credit_card_expiration_year)
      - selectByID(credit_card_expiration_year): "2027"
      - clickByID(credit_card_expiration_month)
      - selectByID(credit_card_expiration_month): "May"
      - clickByCSS(button.cymbal-button-primary)
      - clickByLinkText(Continue Shopping)

  user place orders-Http:
    headers:
      sec-ch-ua: '"Chromium";v="130", "Google Chrome";v="130", "Not?A_Brand";v="99"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"macOS"'
      DNT: '1'
      Upgrade-Insecure-Requests: '1'
      User-Agent: >-
        Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36
        (KHTML, like Gecko) Chrome/130.0.0.0 Safari/537.36
      Accept: >-
        text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://127.0.0.1:52879/product/OLJCESPC7Z'
            method: GET
            label: 'http://127.0.0.1:52879/product/OLJCESPC7Z'
            think-time: 0ms
            headers: {}
          - url: 'http://127.0.0.1:52879/'
            method: GET
            label: 'http://127.0.0.1:52879/'
            think-time: 3211ms
            headers: {}
          - url: 'http://127.0.0.1:52879/product/0PUK6V6EV0'
            method: GET
            label: 'http://127.0.0.1:52879/product/0PUK6V6EV0'
            think-time: 1779ms
            headers: {}
          - url: 'http://127.0.0.1:52879/cart'
            method: POST
            label: 'http://127.0.0.1:52879/cart'
            think-time: 2415ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              product_id: 0PUK6V6EV0
              quantity: '2'
          - url: 'http://127.0.0.1:52879/'
            method: GET
            label: 'http://127.0.0.1:52879/'
            think-time: 1266ms
            headers: {}
          - url: 'http://127.0.0.1:52879/product/9SIQT8TOJO'
            method: GET
            label: 'http://127.0.0.1:52879/product/9SIQT8TOJO'
            think-time: 1852ms
            headers: {}
          - url: 'http://127.0.0.1:52879/cart'
            method: POST
            label: 'http://127.0.0.1:52879/cart'
            think-time: 1935ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              product_id: 9SIQT8TOJO
              quantity: '3'
          - url: 'http://127.0.0.1:52879/'
            method: GET
            label: 'http://127.0.0.1:52879/'
            think-time: 1396ms
            headers: {}
          - url: 'http://127.0.0.1:52879/product/6E92ZMYYFZ'
            method: GET
            label: 'http://127.0.0.1:52879/product/6E92ZMYYFZ'
            think-time: 2124ms
            headers: {}
          - url: 'http://127.0.0.1:52879/cart'
            method: POST
            label: 'http://127.0.0.1:52879/cart'
            think-time: 2511ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              product_id: 6E92ZMYYFZ
              quantity: '3'
          - url: 'http://127.0.0.1:52879/product/0PUK6V6EV0'
            method: GET
            label: 'http://127.0.0.1:52879/product/0PUK6V6EV0'
            think-time: 7666ms
            headers: {}
          - url: 'http://127.0.0.1:52879/cart'
            method: POST
            label: 'http://127.0.0.1:52879/cart'
            think-time: 3126ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              product_id: 0PUK6V6EV0
              quantity: '1'
          - url: 'http://127.0.0.1:52879/cart/checkout'
            method: POST
            label: 'http://127.0.0.1:52879/cart/checkout'
            think-time: 72890ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              city: Mountain View
              country: United States
              credit_card_cvv: '672'
              credit_card_expiration_month: '5'
              credit_card_expiration_year: '2027'
              credit_card_number: '4432801561520454'
              email: someOne@example.de
              state: CA
              street_address: elmstreet
              zip_code: '94043'
          - url: 'http://127.0.0.1:52879/'
            method: GET
            label: 'http://127.0.0.1:52879/'
            think-time: 1915ms
            headers: {}